Revit 2027 API
RebarConstrainedHandle.AllowsConstraintToCustomTarget Method
 Checks if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AllowsConstraintToCustomTarget()
Public Function AllowsConstraintToCustomTarget As Boolean
public:
bool AllowsConstraintToCustomTarget()
member AllowsConstraintToCustomTarget : unit -> bool
Return Value
Boolean
 Returns true if the RebarConstrainedHandle allows constraint of [!:Autodesk::Revit::DB::Structure::RebarConstraintType::ToCustomTarget] type.
See Also
Reference
RebarConstrainedHandle Class
Autodesk.Revit.DB.Structure Namespace